
Функция ОтправитьЛогиВДатаЦентр(Знач Данные = Неопределено, ОбработатьЛогиПослеВыгрузки = Ложь) Экспорт
	//СборСтатистикиСервер.ЗаписатьФактИспользованияСервиса(ПредопределенноеЗначение("Перечисление.ВидыСтатистики.ОтправкаЛогов"));   //TODO - включить после внедрения СбораСтатистики
	СтруктураВозврата = Новый Структура("ОтправленоУдачно, Ошибка", Ложь, "");
	
	Если Не ЗначениеЗаполнено(Данные) Тогда
		ДанныеДляОтправки = ВыгрузкаДанныхСервер.ПолучитьДанныеЛоговДляВыгрузки();
		ОбработатьЛогиПослеВыгрузки = Истина;
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура") Тогда
		ДанныеДляОтправки = XMLСтрока(ВыгрузкаДанныхСервер.ПреобразоватьДанныеСтрокаВХранилище(Данные));
		ОбработатьЛогиПослеВыгрузки = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеДляОтправки) Тогда
		ДиалогиСПользователямиСервер.ПоказатьСообщениеПользователю("Нет данных для выгрузки");
		СтруктураВозврата.Ошибка = "Нет данных для выгрузки";
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	АдресСкрипта = "HomeBudget_backUp/hs/download_log_info/";
	
	ПараметрыПодключения = ИнициализироватьПараметрыПодключения("192.168.1.140");
	ПараметрыЗапроса = ИнициализироватьПараметрыЗапроса(АдресСкрипта);
	
	ПараметрыЗапроса.Метод = "POST";
	
	ПараметрыПодключения.ИмяПользователя = "service";  //TODO: Сделать получение служебных учётных данных
	ПараметрыПодключения.Пароль = "hr65kl81";
	
	//TODO: ssl = Новый ЗащищенноеСоединениеOpenSSL;	
	
	ПараметрыЗапроса.ЗапросHTTP.Заголовки.Вставить("Content-Type", "multipart/form-data");
	
	РазмерФайлаОтправки = XMLСтрока(СтрДлина(ДанныеДляОтправки));
	ПараметрыЗапроса.ЗапросHTTP.Заголовки.Вставить("Content-Length", РазмерФайлаОтправки);
	
	ОтветHTTP = ВыполнитьHTTTP_Запрос(ПараметрыПодключения, ПараметрыЗапроса, Истина, Истина, ДанныеДляОтправки, Истина);
	
	Если ОтветHTTP = Неопределено Тогда
		СтруктураВозврата.ОтправленоУдачно = Ложь;
		СтруктураВозврата.Ошибка = "Не удалось отправить логи.";
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Текст = ОтветHTTP.ПолучитьТелоКакСтроку("utf-8");
	
	Если ОтветHTTP.КодСостояния = 200 Тогда			
		
		СтруктураВозврата.ОтправленоУдачно = Истина;
		
	Иначе
		ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(Текст);
		
		СтруктураВозврата.ОтправленоУдачно = Ложь;
		СтруктураВозврата.Ошибка = Текст;
	КонецЕсли;
	
	Если ОтветHTTP.КодСостояния = 200 И ОбработатьЛогиПослеВыгрузки Тогда
		РегистрыСведений.ЛогиОшибок.ОбработатьЛогиПослеВыгрузки(ДанныеДляОтправки);		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ОтправитьСтатистикуВДатаЦентр(Данные = Неопределено, ВыводитьСообщение = Ложь)Экспорт
	
	Если Не ЗначениеЗаполнено(Данные) Тогда
		Данные = ВыгрузкаДанныхСервер.ПолучитьДанныеЛоговДляВыгрузки();
		Если Не ЗначениеЗаполнено(Данные) Тогда
			Возврат 666;
		КонецЕсли;
	КонецЕсли;
	
	ИмяПользователя = "service";
	Пароль = "hr65kl81";
	
	//TODO: ssl = Новый ЗащищенноеСоединениеOpenSSL;	
	АдресСервер = "192.168.1.140";
	АдресСкрипта = "HomeBudget_backUp/hs/download_statistics/"; 
	
	ПараметрыПодключения = ИнициализироватьПараметрыПодключения(АдресСервер);
	ПараметрыЗапроса = ИнициализироватьПараметрыЗапроса(АдресСкрипта);
	
	ПараметрыЗапроса.Метод = "POST";
	
	ПараметрыПодключения.ИмяПользователя = ИмяПользователя;
	ПараметрыПодключения.Пароль = Пароль;
	
	ПараметрыЗапроса.ЗапросHTTP.Заголовки.Вставить("Content-Type", "text/html");
	
	ОтветHTTP = ВыполнитьHTTTP_Запрос(ПараметрыПодключения, ПараметрыЗапроса, Истина, Истина, Данные, Истина);
	
	Текст = ОтветHTTP.ПолучитьТелоКакСтроку("utf-8");
	
	Если ОтветHTTP.КодСостояния = 200 Тогда			
		Если ВыводитьСообщение Тогда
			//ДиалогиСПользователямиКлиент.ПоказатьСообщениеПользователю(Текст);
		КонецЕсли;
	Иначе
		ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(Текст);
	КонецЕсли;
	
	Возврат ОтветHTTP.КодСостояния;
КонецФункции

Функция ИнициализироватьПараметрыПодключения(лСервер, ИспользоватьSSL = Ложь)
	Параметры = Новый Структура;
	Параметры.Вставить("Сервер");
	Параметры.Вставить("Порт");
	Параметры.Вставить("ИмяПользователя");
	Параметры.Вставить("Пароль");
	Параметры.Вставить("Прокси");
	Параметры.Вставить("Таймаут");
	Параметры.Вставить("ЗащищенноеСоединение");
	
	Параметры.Сервер = лСервер;
	Параметры.Порт = ?(ИспользоватьSSL, 443, 80);
	Параметры.ИмяПользователя = "";
	Параметры.Пароль = "";
	Параметры.Прокси = Новый ИнтернетПрокси;
	Параметры.Таймаут = 30;
	Параметры.ЗащищенноеСоединение = ?(ИспользоватьSSL, Новый ЗащищенноеСоединениеOpenSSL, Неопределено);
	
	Возврат Параметры;
КонецФункции

Функция ИнициализироватьПараметрыЗапроса(АдресСкрипта)
	Параметры = Новый Структура("Метод, ЗапросHTTP, АдресСкрипта");
	Параметры.Метод = "";
	Параметры.ЗапросHTTP = Новый HTTPЗапрос(АдресСкрипта, Новый Соответствие);
	Параметры.АдресСкрипта = АдресСкрипта;
	
	Возврат Параметры;
КонецФункции

Функция ВыполнитьHTTTP_Запрос(ПараметрыПодключения, ПараметрыЗапроса, ПоказатьСообщение = Истина, УстановитьТело = Ложь, ТелоЗапроса = Неопределено, ТелоСтрока = Ложь) Экспорт
	
	ХТТП = Новый HTTPСоединение(ПараметрыПодключения.Сервер,, ПараметрыПодключения.ИмяПользователя, ПараметрыПодключения.Пароль);
	Попытка
		ЗапросHTTP = ПараметрыЗапроса.ЗапросHTTP;
		Если УстановитьТело И ТелоЗапроса <> Неопределено Тогда
			Если ТелоСтрока Тогда
				ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса);
			Иначе
				ЗапросHTTP.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);
			КонецЕсли;
		КонецЕсли;
		
		Возврат ХТТП.ВызватьHTTPМетод(ПараметрыЗапроса.Метод, ЗапросHTTP);
		
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(Текст);
		
		Если ПоказатьСообщение Тогда 
			//ДиалогиСПользователемКлиент.ОбработатьИнформациюОбОшибкеДляПользователя(Текст);    //TODO - разобраться
		КонецЕсли;
		
		Возврат Неопределено;
		
	КонецПопытки;

КонецФункции

Функция ОтпарвитьДанныеНаСервер(Путь, ИмяПользователя, Пароль, Данные = Неопределено, ПоказатьСообщение = Истина, ТелоСтрокиСтатистика = "") Экспорт
	//ВОПРОС проверить ssl на реальном сервере с ssl
	
	АдресСкрипта = "HomeBudget_backUp/hs/exchangeIncrement/" + ИмяПользователя;
	
	ПараметрыПодключения = ИнициализироватьПараметрыПодключения("192.168.1.140");
	ПараметрыЗапроса = ИнициализироватьПараметрыЗапроса(АдресСкрипта);
	
	ПараметрыЗапроса.Метод = "POST";
	
	ПараметрыПодключения.ИмяПользователя = ИмяПользователя;
	ПараметрыПодключения.Пароль = Пароль;
	
	//TODO: ssl = Новый ЗащищенноеСоединениеOpenSSL;	
		
	СодержимоеФайла = Новый ДвоичныеДанные(Путь); 
	
	РазмерФайлаОтправки = XMLСтрока(СодержимоеФайла.Размер());
	
	Если ЗначениеЗаполнено(ТелоСтрокиСтатистика) Тогда
		//ТелоСтрокиСтатистика = XMLСтрока(ОбщиеПроцедурыИФункцииСервер.ПоместитьДанныеВХранилищеЗначения(ТелоСтрокиСтатистика));
	КонецЕсли;	
	
	ПараметрыЗапроса.ЗапросHTTP.Заголовки.Вставить("Content-Type", "multipart/form-data");	                 
	ПараметрыЗапроса.ЗапросHTTP.Заголовки.Вставить("Content-Length", РазмерФайлаОтправки);
	ПараметрыЗапроса.ЗапросHTTP.Заголовки.Вставить("Accept-Charset", КодировкаТекста.UTF8);
	ПараметрыЗапроса.ЗапросHTTP.Заголовки.Вставить("Accept-Language", "ru");
	ПараметрыЗапроса.ЗапросHTTP.Заголовки.Вставить("user_id", ОбщиеПроцедурыИФункцииСервер.ПолучитьЗначениеКонстанты("user_id"));
	ПараметрыЗапроса.ЗапросHTTP.Заголовки.Вставить("statistic", ТелоСтрокиСтатистика);
	
	ОтветHTTP = ВыполнитьHTTTP_Запрос(ПараметрыПодключения, ПараметрыЗапроса, ПоказатьСообщение, Истина, СодержимоеФайла);
	
	Если ОтветHTTP = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Текст = ОтветHTTP.ПолучитьТелоКакСтроку("utf-8");
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(Текст);
		Если ПоказатьСообщение Тогда 
			//TODO: ДиалогиСПользователямиКлиент.ОбработатьИнформациюОбОшибкеДляПользователя(Текст);
		КонецЕсли;
	КонецЕсли;
	Возврат ОтветHTTP.КодСостояния = 200;
	
КонецФункции

Функция СоздатьНовогоПользователя(СтруктураУчетки) Экспорт
	
	ИмяПользователя = "Service";
	Пароль = "hr65kl81";
	
	АдресСкрипта = "intermediateServer/hs/service/" + СтруктураУчетки.Логин + "/" + СтруктураУчетки.Пароль;
	
	ПараметрыПодключения = ИнициализироватьПараметрыПодключения("192.168.1.140");
	ПараметрыЗапроса = ИнициализироватьПараметрыЗапроса(АдресСкрипта);
	
	ПараметрыЗапроса.Метод = "GET";
	
	ПараметрыПодключения.ИмяПользователя = ИмяПользователя;
	ПараметрыПодключения.Пароль = Пароль;
	
	ОтветHTTP = ВыполнитьHTTTP_Запрос(ПараметрыПодключения, ПараметрыЗапроса);
	
	ОтветТекст = ОтветHTTP.ПолучитьТелоКакСтроку("utf-8");
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(ОтветТекст);
	Иначе
		ДиалогиСПользователямиСервер.ПоказатьСообщениеПользователю(ОтветТекст);
	КонецЕсли;
	
	Возврат ОтветHTTP;
КонецФункции