
#Область ВыгрзукаЛогов
Функция ПолучитьДанныеЛоговДляВыгрузки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ *
	               |ИЗ
	               |	РегистрСведений.ЛогиОшибок КАК ЛогиОшибок
	               |ГДЕ
	               |	НЕ ЛогиОшибок.Отправлено";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ХЗ = Новый ХранилищеЗначения(РезультатЗапроса.Выгрузить(), Новый СжатиеДанных(9));
		Данные = XMLСтрока(ХЗ);
		Возврат Данные;
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции      

#КонецОбласти

Функция ПреобразоватьДанныеСтрокаВХранилище(Знач ДанныеСтрока) Экспорт
	Возврат Новый ХранилищеЗначения(ДанныеСтрока, Новый СжатиеДанных(9));
КонецФункции














