
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.Наименование = СокрЛП(Объект.Наименование);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере(Отказ, Объект.Ссылка, Элементы.Наименование);
	Если Отказ Тогда
		ДиалогиСПользователемКлиент.ПоказатьСообщениеПользователю("Валюта с таким наименованием уже есть!");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПередЗаписьюНаСервере(Отказ, Ссылка, Наименование)
	Отказ = ОбщиеПроцедурыИФункцииСервер.ПроверитьНаличиеДубляНаименования(Наименование, "Валюты", Ссылка); 
КонецПроцедуры
