#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьСтатистику(СтруктураДанных) Экспорт
	Попытка
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураДанных);
		МенеджерЗаписи.Записать(Ложь);
	Исключение
		Ошибка = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Текст = "Не удалось записать статистику." + Символы.ПС + Ошибка;
		ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(Текст);
	КонецПопытки;

КонецПроцедуры

Функция ПолучитьСтатистику(ПолучатьПредставленияСсылок) Экспорт
	МассивСтруктурДанных = Новый Массив();
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтатистикаИспользованияСервисов.Период,
		|	СтатистикаИспользованияСервисов.УниверсальнаяДата,
		|	СтатистикаИспользованияСервисов.ЧасовойПояс,
		|	СтатистикаИспользованияСервисов.user_id,
		|	ВЫБОР
		|		КОГДА &ПолучатьПредставленияСсылок
		|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(СтатистикаИспользованияСервисов.ВидСтатистики)
		|		ИНАЧЕ СтатистикаИспользованияСервисов.ВидСтатистики
		|	КОНЕЦ КАК ВидСтатистики,
		|	СтатистикаИспользованияСервисов.Частота
		|ИЗ
		|	РегистрСведений.СтатистикаИспользованияСервисов КАК СтатистикаИспользованияСервисов
		|ГДЕ
		|	НЕ СтатистикаИспользованияСервисов.Отправлено";
	
	Запрос.УстановитьПараметр("ПолучатьПредставленияСсылок", ПолучатьПредставленияСсылок);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураДанныхСтатистики = СформироватьСтруктуруСтатистики();
		ЗаполнитьЗначенияСвойств(СтруктураДанныхСтатистики, ВыборкаДетальныеЗаписи);
		СтруктураДанныхСтатистики.Удалить("Отправлено");
		МассивСтруктурДанных.Добавить(СтруктураДанныхСтатистики);
	КонецЦикла;
	Возврат МассивСтруктурДанных;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция СформироватьСтруктуруСтатистики() Экспорт
	УчетнаяЗапись = ОбщиеПроцедурыИФункцииСервер.ПолучитьУчетнуюЗапись();
	СтруктураСтатистики = Новый Структура;
	СтруктураСтатистики.Вставить("ПериодРегистрации", ТекущаяДатаСеанса());
	СтруктураСтатистики.Вставить("УниверсальнаяДата", ТекущаяУниверсальнаяДата());
	СтруктураСтатистики.Вставить("User_id", УчетнаяЗапись.id_user);
	СтруктураСтатистики.Вставить("ЧасовойПояс", ЧасовойПоясСеанса());
	СтруктураСтатистики.Вставить("ВидСтатистики");
	СтруктураСтатистики.Вставить("Частота", 1);
	СтруктураСтатистики.Вставить("Отправлено", Ложь);
	Возврат СтруктураСтатистики;
КонецФункции
#КонецОбласти
