
#Область СлужебныеПроцедурыИФункции

Функция ЗаписатьНовуюУчетнуюЗапись(Логин, ID_user, ХешПароля) Экспорт
	Попытка
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Логин = Логин;
		МенеджерЗаписи.Пароль = ХешПароля;
		МенеджерЗаписи.id_user = ID_user;
		МенеджерЗаписи.Записать();
		
		Возврат Истина;
	Исключение
		Ошибка = "Не удалось зарегестрировать учётную запись в приложении.";
		Причина = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(Ошибка + Символы.ПС + Причина);
		
		Возврат Ложь
	КонецПопытки;
КонецФункции

Функция ПолучитьУчетнуюЗапись() Экспорт
	Структура = Новый Структура("Логин, Пароль, id_user");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	УчетныеЗаписи.Логин КАК Логин,
					|	УчетныеЗаписи.Пароль КАК Пароль,
					|	УчетныеЗаписи.id_user
					|ИЗ
					|	РегистрСведений.УчетныеЗаписи КАК УчетныеЗаписи";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		ВыборкаДетальныеЗаписи.Следующий();
		ЗаполнитьЗначенияСвойств(Структура, ВыборкаДетальныеЗаписи);
		Возврат Структура
	КонецЕсли;
КонецФункции

#КонецОбласти