
Функция ПолучитьУчетнуюЗапись() Экспорт
	Структура = Новый Структура("Логин, Пароль");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетныеЗаписи.Логин КАК Логин,
	               |	УчетныеЗаписи.Пароль КАК Пароль
	               |ИЗ
	               |	РегистрСведений.УчетныеЗаписи КАК УчетныеЗаписи";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Структура.Логин = ВыборкаДетальныеЗаписи.Логин;
			Структура.Пароль = XMLЗначение(Тип("ХранилищеЗначения"), ВыборкаДетальныеЗаписи.Пароль).Получить();
		КонецЦикла;
		Возврат Структура
	КонецЕсли;
КонецФункции