
#Область СлужебныеПроцедурыИФункции

Функция ЗаписатьНовуюУчетнуюЗапись(Логин, ID_user, Хешпароля) Экспорт
	СтруткрураВозврата = Новый Структура("Выполнено, ТекстОшибки", Ложь, "");
	
	Попытка
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Логин = Логин;
		МенеджерЗаписи.Пароль = Хешпароля;
		МенеджерЗаписи.id_user = ID_user;
		
		СтруткрураВозврата.Выполнено = Истина;;
		Возврат СтруткрураВозврата;
	Исключение
		Ошибка = "Не удалось записать новую учётную запись."; //TODO: добавить слудебное сообщение
		ДиалогиСПользователямиСервер.ПоказатьСообщениеПользователю(Ошибка);
		
		СтруткрураВозврата.ТекстОшибки = Ошибка;
		Возврат СтруткрураВозврата;
	КонецПопытки;
КонецФункции

Функция ПолучитьУчетнуюЗапись() Экспорт
	Структура = Новый Структура("Логин, Пароль");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетныеЗаписи.Логин КАК Логин,
	               |	УчетныеЗаписи.Пароль КАК Пароль
	               |ИЗ
	               |	РегистрСведений.УчетныеЗаписи КАК УчетныеЗаписи";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Структура.Логин = ВыборкаДетальныеЗаписи.Логин;
			Структура.Пароль = XMLЗначение(Тип("ХранилищеЗначения"), ВыборкаДетальныеЗаписи.Пароль).Получить();
		КонецЦикла;
		Возврат Структура
	КонецЕсли;
КонецФункции

#КонецОбласти