
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Ответ = ЗапросыHTTP.ОтправитьЛогиВДатаЦентр();
	//Если Ответ.ОтправленоУдачно Тогда
	//	ПоказатьОповещениеПользователя("Логи отправлены успешно");
	//Иначе
	//	ПоказатьОповещениеПользователя("Произошла ошибка при отправке логов");
	//КонецЕсли;
	
	//Фон
	ПоказатьОповещениеПользователя("Запускаю отправку логов...");
	ВыгрузкаДанныхСервер.ОтправитьЛогиФонСервер();
	НачатьОбработчикОжидания(ПредопределенноеЗначение("Перечисление.ПроверяемыеСобытияОбработчикаОжидания.ОтправкаЛогов"));
	//TODO: По умолчанию сделать сразу и отправку статистики
КонецПроцедуры
