
&НаКлиенте
Процедура УстановитьНачальныйОстатокПриИзменении(Элемент)	 
	УстановитьВидимостьДоступностьЭлементов();
	Если НЕ Объект.УстановитьНачальныйОстаток И Объект.НачальныйОстаток <> 0 Тогда 
		ТекстВопроса = "Поле начального остатка не равно нулю. Обнулить начальный остаток счёта?";
		ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьВыполенениеПослеОтвета", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.УстановитьНачальныйОстаток И Элементы.НачальныйОстаток.Доступность Тогда 
		Если Объект.НачальныйОстаток = 0 Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Введите значение начального остатка!";
			Сообщение.Поле = "Элементы.НачальныйОстаток";
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить();
			Отказ = Истина;
		Иначе
			Если Модифицированность Тогда
				НовыйДокумент = ?(ЗначениеЗаполнено(Объект.Документ), Объект.Документ, Документы.ВводНачальныхОстатков.СоздатьДокумент());
				Если НЕ ЗначениеЗаполнено(Объект.Документ) Тогда
					НовыйДокумент.Дата = ТекущаяДата();
					НовыйДокумент.Счет = ТекущийОбъект.Ссылка;
					НовыйДокумент.ИсточникПоступления = ПредопределенноеЗначение("Справочник.ИсточникПоступлений.ВводНачальныхОстатков");
					НовыйДокумент.Комментарий = "Создан при вводе начального остатка в карточке счета";
				КонецЕсли;
				НовыйДокумент.Сумма = Объект.НачальныйОстаток;
				
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
				ТекущийОбъект.Документ = НовыйДокумент.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТекущийОбъект.ДатаСоздания = ?(ЗначениеЗаполнено(Объект.ДатаСоздания), Объект.ДатаСоздания, ТекущаяДата());
	ТекущийОбъект.Записан = Истина;
	Элементы.НачальныйОстаток.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	Элементы.НачальныйОстаток.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыполенениеПослеОтвета(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		Объект.НачальныйОстаток = 0;
		Элементы.ГруппаВводаОстатка.Видимость = Ложь;
		Элементы.НачальныйОстаток.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементов()
	Элементы.ГруппаВводаОстатка.Видимость = Объект.УстановитьНачальныйОстаток ИЛИ Объект.НачальныйОстаток <> 0;
	Элементы.НачальныйОстаток.Доступность = Объект.УстановитьНачальныйОстаток;
	//Элементы.НачальныйОстаток.Доступность = Объект.Записан;
	//Элементы.УстановитьНачальныйОстаток.Доступность = Объект.Записан;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.Наименование = СокрЛП(Объект.Наименование);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере(Отказ, Объект.Ссылка, Элементы.Наименование);
	Если Отказ Тогда
		ДиалогиСПользователемКлиент.ПоказатьСообщениеПользователю("Валюта с таким наименованием уже есть!");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПередЗаписьюНаСервере(Отказ, Ссылка, Наименование)
	Отказ = ОбщиеПроцедурыИФункцииСервер.ПроверитьНаличиеДубляНаименования(Наименование, "Валюты", Ссылка); 
КонецПроцедуры
