
Процедура ЗаписатьФактИспользованияСервиса(ВидСтатистики, СразуОтправитьВДатаЦентр = Ложь) Экспорт
	Попытка
		
		ПроверитьИдПользователя();
		
		ПериодРегистрации = ТекущаяДата();
		УниверсальнаяДата = ТекущаяУниверсальнаяДата();
		user_id = Константы.user_id.Получить();
		
		Если СразуОтправитьВДатаЦентр Тогда
			ТелоСтроки = СтрШаблон("date=%1;uDate=%2;GMT=%3;user_id=%4;typeStat=%5", XMLСтрока(ПериодРегистрации), XMLСтрока(УниверсальнаяДата), ЧасовойПояс(), user_id, Перечисления.ВидыСтатистики.Индекс(ВидСтатистики));		
			ОтветСервера = ЗапросыHTTP.ОтправитьСтатистикуВДатаЦентр(ТелоСтроки);
		Иначе
			ОтветСервера = 666;
		КонецЕсли;		
		
		МенеджерЗаписи = РегистрыСведений.СтатистикаИспользованияСервисов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ПериодРегистрации;
		МенеджерЗаписи.УниверсальнаяДата = УниверсальнаяДата;
		МенеджерЗаписи.ЧасовойПояс = ЧасовойПояс();
		МенеджерЗаписи.user_id = user_id;
		МенеджерЗаписи.ВидСтатистики = ВидСтатистики;
		МенеджерЗаписи.Частота = 1;
		МенеджерЗаписи.Отправлено = ОтветСервера = 200;
		МенеджерЗаписи.Записать(Ложь);
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		Ошибка = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщиеПроцедурыИФункцииСервер.ЗаписатьЛоги(Ошибка);
	КонецПопытки;
КонецПроцедуры

Процедура ПроверитьИдПользователя() Экспорт  //TODO: УДАЛИТЬ!!! Сделать формирование id по уникальному идентификатору 1с. ID выдавать на сервере при регистрации пользователя).
	Если НЕ ЗначениеЗаполнено(Константы.user_id.Получить()) Тогда
		
		ДатаВремя = Строка(ТекущаяДата());
		
		ГСЧ = Новый ГенераторСлучайныхЧисел;
		СлЧисло = Строка(ГСЧ.СлучайноеЧисло(10000000, 99999999));
		
		user_id = СлЧисло + ДатаВремя;
		user_id = СтрЗаменить(user_id, " ", "");
		user_id = СтрЗаменить(user_id, ":", "");
		user_id = СтрЗаменить(user_id, ".", "");
		user_id = СтрЗаменить(user_id, Символы.НПП, "");
		
		Константы.user_id.Установить(user_id);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТелоСтрокиСтатистики(ВидСтатистики) Экспорт //TODO: где используется?
	
	ПериодРегистрации = ТекущаяДата();
	УниверсальнаяДата = ТекущаяУниверсальнаяДата();
	user_id = Константы.user_id.Получить();
	
	ТелоСтроки = СтрШаблон("date=%1;uDate=%2;GMT=%3;user_id=%4;typeStat=%5", XMLСтрока(ПериодРегистрации), XMLСтрока(УниверсальнаяДата), ЧасовойПояс(), user_id, Перечисления.ВидыСтатистики.Индекс(ВидСтатистики));
							
	Возврат ТелоСтроки;
	
КонецФункции
