
Процедура ЗаписатьФактИспользованияСервиса(ВидСтатистики, СразуОтправитьВДатаЦентр = Ложь) Экспорт
	Попытка
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ПериодРегистрации", ТекущаяДата());
		СтруктураДанных.Вставить("УниверсальнаяДата", ТекущаяУниверсальнаяДата());
		СтруктураДанных.Вставить("User_id", Константы.user_id.Получить());
		СтруктураДанных.Вставить("ЧасовойПояс", ЧасовойПоясСеанса());
		СтруктураДанных.Вставить("ВидСтатистики", ВидСтатистики);
		СтруктураДанных.Вставить("Частота", 1);
		
		Если СразуОтправитьВДатаЦентр Тогда
			ТелоСтроки = СтрШаблон("date=%1;uDate=%2;GMT=%3;user_id=%4;typeStat=%5", XMLСтрока(ПериодРегистрации), XMLСтрока(УниверсальнаяДата), ЧасовойПояс(), user_id, Перечисления.ВидыСтатистики.Индекс(ВидСтатистики));		
			ОтветСервера = ЗапросыHTTP_Сервер.ОтправитьСтатистикуВДатаЦентр(ТелоСтроки);
		Иначе
			ОтветСервера = 666;
		КонецЕсли;
		
		СтруктураДанных.Вставить("Отправлено", ОтветСервера = 200);
		
		МенеджерЗаписи = РегистрыСведений.СтатистикаИспользованияСервисов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ПериодРегистрации;
		МенеджерЗаписи.УниверсальнаяДата = УниверсальнаяДата;
		МенеджерЗаписи.ЧасовойПояс = ЧасовойПояс();
		МенеджерЗаписи.user_id = user_id;
		МенеджерЗаписи.ВидСтатистики = ВидСтатистики;
		МенеджерЗаписи.Частота = 1;
		МенеджерЗаписи.Отправлено = ОтветСервера = 200;
		МенеджерЗаписи.Записать(Ложь);
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		Ошибка = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщиеПроцедурыИФункцииСервер.ЗаписатьЛоги(Ошибка);
	КонецПопытки;
КонецПроцедуры


