
&НаКлиенте
Процедура Регистрация(Команда)
	Форма = ПолучитьФорму("ОбщаяФорма.ФормаРегистрацииНаСервере");
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЛокально(Команда)
	ЗагрузкаДанныхКлиент.ЗагрузитьДанные(Ложь,,, ТолькоСправочники);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьССервера(Команда)
	Если НЕ ЗначениеЗаполнено(Логин) ИЛИ НЕ ЗначениеЗаполнено(Пароль) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Введите данные учётной записи (Логин и Пароль)!";
		Сообщение.Сообщить();
	Иначе
		ЗагрузкаДанныхКлиент.ЗагрузитьДанные(Истина, Логин, Пароль, ТолькоСправочники);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЛокально(Команда)
	ВыгрузкаДанныхКлиент.ВыгрузитьДанные(Ложь);
	ЗаполнитьИнформациюОПоследнейКопии();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаСервере(Команда)
	Если НЕ ЗначениеЗаполнено(Логин) ИЛИ НЕ ЗначениеЗаполнено(Пароль) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Введите данные учётной записи (Логин и Пароль)!";
		Сообщение.Сообщить();
	Иначе
		ВыгрузкаДанныхКлиент.ВыгрузитьДанные(Истина, Логин, Пароль, ТолькоСправочники);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
	Если НЕ ОбщиеПроцедурыИФункцииКлиент.ПроверитьКорректностьСимволовЛогина(Логин) Тогда
		ТекущийЭлемент = Элементы.Логин;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьИнформациюОПоследнейКопии();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформациюОПоследнейКопии()
	Путь = КаталогДокументов() + "\backUp_1CDB.txt";
	МассивФайлов = НайтиФайлы(Путь);
	Если ЗначениеЗаполнено(МассивФайлов) Тогда
		Файл = МассивФайлов[0];
		ДатаФайла = Файл.ПолучитьВремяИзменения();
		ДатаЛокальнойКопии = ДатаФайла;
	КонецЕсли;
	УчетныеЗаписи = ОбщиеПроцедурыИФункцииСервер.ПолучитьУчетнуюЗапись();
	Если ЗначениеЗаполнено(УчетныеЗаписи) Тогда
		Логин = УчетныеЗаписи.Логин;
		Пароль = УчетныеЗаписи.Пароль;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура АвторизацияДругойУчетнойЗаписиНаСервере()
	// 1 выводить список зарегестрированных учетных записей
	// 2 заполнять поля для авторизации выбранными данными
	// 3 установить метку ПоУмолчанию в регистре УчетныеЗаписи у всех записей, кроме выбранной в ложь
	// 4 у выбранной записи установить метку ПоУмолчанию в истина
КонецПроцедуры

&НаКлиенте
Процедура АвторизацияДругойУчетнойЗаписи(Команда)
	АвторизацияДругойУчетнойЗаписиНаСервере();
КонецПроцедуры

