
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановкаВидимостиДоступностиЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Текст_АвторизацияНажатие(Элемент)
	Элементы.Группа2.ТекущаяСтраница = Элементы.Авторизация;
	УстановкаВидимостиДоступностиЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура Текст_РегистрацияНажатие(Элемент)
	Элементы.Группа2.ТекущаяСтраница = Элементы.Регистрация;
	УстановкаВидимостиДоступностиЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура Логин1ПриИзменении(Элемент)
	Если НЕ ОбщиеПроцедурыИФункцииКлиент.ПроверитьКорректностьСимволовЛогина(Логин) Тогда
		ДиалогиСПользователемКлиент.ПоказатьСообщениеПользователю("Логин (e-mail) содержит недопустимые символы");
	КонецЕсли;	
КонецПроцедуры

#Конецобласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АвторизацияКоманда(Команда)
	ПараметрыСервиса = ПолучитьСтруктуруПараметров();
	ПараметрыСервиса.ИмяСервиса = "UserAuthorization";
	ПараметрыСервиса.ИмяПортаСервиса = "UserAuthorizationSoap";
	ПараметрыСервиса.ИмяФайлаСервиса = "UserAuthorization.1cws";
	ПараметрыСервиса.ИмяПользователя = "Регистратор";//TODO: Другое имя пользователя?
	ПараметрыСервиса.Пароль = "";//?

	ХешПароль = ОбщиеПроцедурыИФункцииСервер.ХешироватьпарольФункции(Пароль);
	
	Авторизатор = РаботаСWebСервисами_Сервер.СформироватьСеансВебСервиса(ПараметрыСервиса);
	
	Результат = Авторизатор.Авторизация(Логин, ХешПароль);
	
	Если Не Результат.Выполнено Тогда
		ТекстСообщ = "Не удалось авторизироваться на сервере. Возможно, указан не верный Логин или Пароль.";
		ТекстДляЛогирования = ТекстСообщ + Символы.ПС + Результат.Ошибка;
		ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(ТекстДляЛогирования);
		ДиалогиСПользователемКлиент.ПоказатьСообщениеПользователю(ТекстДляЛогирования);
	Иначе
		ДиалогиСПользователемКлиент.ПоказатьСообщениеПользователю("Регистрация выполнена успешно!");
		ОбщиеПроцедурыИФункцииСервер.ЗарегестрироватьУчетнуюЗаписьВСистеме(Логин, ХешПароль, Результат.id_user);
		
		//TODO: что делаем дальше? Пишем данные в регистр УчетныеЗаписи? Тогда нужен возврат id... !!!
		// Продумать, в каких случаях нужна будет авторизация, кроме случая чистовой установки/переустановки приложения
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РегстрацияКоманда(Команда)
	Если НЕ ОбщиеПроцедурыИФункцииКлиент.ПроверитьКорректностьСимволовЛогина(Логин) Тогда
		ДиалогиСПользователемКлиент.ПоказатьСообщениеПользователю("Логин (e-mail) содержит недопустимые символы");
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьПароли(Пароль) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыполнитьРегистрациюНаСервереДанных(Логин, Пароль) Тогда
		ДиалогиСПользователемКлиент.ПоказатьСообщениеПользователю("Регистрация выполнена успешно!");
	Иначе
		ДиалогиСПользователемКлиент.ПоказатьСообщениеПользователю("Не удалось выполнить регистрацию... Попробуйте выполнить операцию позже");
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановкаВидимостиДоступностиЭлементов()
	Элементы.Текст_Авторизация.Доступность = Элементы.Группа2.ТекущаяСтраница <> Элементы.Авторизация;
	Элементы.Текст_Регистрация.Доступность = Элементы.Группа2.ТекущаяСтраница <> Элементы.Регистрация;
КонецПроцедуры

&НаКлиенте
Функция ПроверитьПароли(Пароль)
	Если ОбщиеПроцедурыИФункцииКлиент.ПроверитьКорректностьСимволовПароля(Пароль) Тогда
		УстановкаВидимостиДоступностиЭлементов();
		Возврат Истина;
	Иначе		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Пароль содержит запрещённые символы!"; //TODO: Сделать подсказку, какие симвоолы должны быть!
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ВыполнитьРегистрациюНаСервереДанных(Логин, Пароль)
	
	ПараметрыСервиса = ПолучитьСтруктуруПараметров();
	ПараметрыСервиса.ИмяСервиса = "UserAuthorization";
	ПараметрыСервиса.ИмяПортаСервиса = "UserAuthorizationSoap";
	ПараметрыСервиса.ИмяФайлаСервиса = "UserAuthorization.1cws";
	ПараметрыСервиса.ИмяПользователя = "Регистратор пользователей";
	ПараметрыСервиса.Пароль = "hr65kl81";

	ХешПароль = ОбщиеПроцедурыИФункцииСервер.ХешироватьпарольФункции(Пароль);
	
	//АдресСоединения = ПараметрыСерверов.ПолучитьАдресСервера();
	//ПространствоИмен = "localhost";
	//ИмяСервиса = "UserAuthorization";
	//ИмяПортаСервиса = "UserAuthorizationSoap";
	//АдресПодключения = СтрШаблон("http://%1/HB_Server/ws/UserAuthorization.1cws", АдресСоединения);
	//Регистратор = WSСсылки.АвторизацияНаСервереДанных(ПространствоИмен, ИмяСервиса, ИмяПортаСервиса,,, АдресПодключения);
	//Регистратор.Пользователь = "Регистратор"; //!!!
	
	Регистратор = РаботаСWebСервисами_Сервер.СформироватьСеансВебСервиса(ПараметрыСервиса);
	
	СтрокаОтвета = Регистратор.Регистрация(Логин, ХешПароль);
	Результат = ОбщиеПроцедурыИФункцииСервер.ПолучитьСтруктуруИзСтрокиJSON(СтрокаОтвета);
	
	Если Результат.Выполнено Тогда
		Ответ = РегистрыСведений.УчетныеЗаписи.ЗаписатьНовуюУчетнуюЗапись(Логин, Результат.id_user, ХешПароль);
		Возврат Истина;
		//Возврат Ответ;	
	Иначе
		Возврат Ложь;// TODO:
	КонецЕсли;

КонецФункции

Функция ПолучитьСтруктуруПараметров()
	ПараметрыСервиса = Новый Структура();
	ПараметрыСервиса.Вставить("ИмяСервиса");
	ПараметрыСервиса.Вставить("ИмяПортаСервиса");
	ПараметрыСервиса.Вставить("ИмяФайлаСервиса");
	ПараметрыСервиса.Вставить("ИмяПользователя");
	ПараметрыСервиса.Вставить("Пароль");
	Возврат ПараметрыСервиса;
КонецФункции
#КонецОбласти
