

//TODO: временная команда на время тестов. В релизе удалить!!!
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Логин = "maksgts@gmail.com";
	Пароль = "hr65kl81";
	
	Структура = УпаковатьУчетныеДанные(Логин, Пароль);
	ЗаписатьДанныеУчетнойЗаписи(Логин, Структура.Пароль);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеУчетнойЗаписи(НовыйЛогин, НовыйПароль)
		МенеджерЗаписи = РегистрыСведений.УчетныеЗаписи.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Логин = НовыйЛогин;
		МенеджерЗаписи.Пароль = НовыйПароль;
		МенеджерЗаписи.Записать();	
КонецПроцедуры

&НаСервере
Функция УпаковатьУчетныеДанные(НовыйЛогин, НовыйПароль)
	Структура = Новый Структура("Логин, Пароль");
	Структура.Логин = XMLСтрока(Новый ХранилищеЗначения(НовыйЛогин));
	Структура.Пароль = XMLСтрока(Новый ХранилищеЗначения(НовыйПароль));
	Возврат Структура;	
КонецФункции