
Функция ПолучитьАдресСервера() Экспорт
	Возврат "192.168.0.215";
КонецФункции

Функция ПолуитьАдресСкрипта(Метод) Экспорт
	Если Метод = "РегистрацияПользователя" Тогда
		Возврат "intermediateserver/hs/service/";
	ИначеЕсли Метод = "ВыгрузкаБэкапа" Тогда
		Возврат "HB_Server/hs/exchangeIncrement/"; 
	ИначеЕсли Метод = "ЗагрузкаБэкапа" Тогда
		Возврат "HB_Server/hs/exchangeIncrement/";
	ИначеЕсли Метод = "ВыгрузкаЛогов" Тогда
		Возврат "HB_Server/hs/download_log_info/";
	ИначеЕсли Метод = "ВыгрузкаСтатистики" Тогда
		Возврат "HB_Server/hs/download_statistics/";
	КонецЕсли;
КонецФункции

Функция ПолучитьЛогинДляБэкапа() Экспорт
	Возврат "Бэкапы";
КонецФункции