
Функция ПолучитьФормуГлавногоЭкрана() Экспорт
	Возврат ПолучитьФорму("ОбщаяФорма.ГлавныйЭкран");
КонецФункции

Процедура ОбновиьГлавныйЭкран() Экспорт
	Окна = ПолучитьОкна();
	Для Каждого мОкно Из Окна Цикл
		Если мОкно.Заголовок = "Домашний бюджет" И мОкно.НачальнаяСтраница Тогда
			Форма = мОкно.Содержимое[0].ЭтаФорма;
			Форма.ОбновитьЭкран();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьСчет(Объект, СчетПоступления)Экспорт
	ОбщиеПроцедурыИФункцииСервер.УстановитьСчет(Объект, СчетПоступления);
КонецПроцедуры