
#Область ПрограммныйИнтерфейс
// Записать использования сервиса.
// 
// Параметры:
//  ВидСтатистики			 - ПеречислениеСсылка.ВидыСтатистики
//  СразуОтправитьВДатаЦентр - Булево
//	Частота 	 			 - Число - Частота использования текущего сервиса. По умолчанию = 1.  
Процедура ЗаписатьФактИспользованияСервиса(ВидСтатистики, СразуОтправитьВДатаЦентр = Ложь, Частота = 1) Экспорт
	ЗаписатьИспользованияСервисаВРегистр(ВидСтатистики, СразуОтправитьВДатаЦентр, Частота);
КонецПроцедуры

// Получить статистику.
// Параметры:
// ПолучатьПредставлениеСсылки - Булево
// 
// Возвращаемое значение:
//  Массив - Массив:
// * СтруктураДанныхСтатистики - Структура:
// * ПериодРегистрации - Дата 
// * УниверсальнаяДата - Дата
// * User_id 		   - УникальныйИдентификатор	
// * ЧасовойПояс       - Строка
// * ВидСтатистики 	   - ПеречислениеСсылка.ВидыСтатистики
// * Частота 		   - Число
// * Отправлено 	   - Булево
Функция ПолучитьСтатистику(ПолучатьПредставлениеСсылки) Экспорт
	Возврат РегистрыСведений.СтатистикаИспользованияСервисов.ПолучитьСтатистику(ПолучатьПредставлениеССылки);
КонецФункции

// Отправить статистику на сервер данных.
Процедура ОтправитьСтатистикуНаСерверДанных() Экспорт
	ВыгрузкаДанныхСервер.ВыгрузитьСтатистикуНаСервер();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьИспользованияСервисаВРегистр(ВидСтатистики, СразуОтправитьВДатаЦентр, Частота) Экспорт
	СтруктураДанных = СформироватьСтруктуруСтатистики();
	СтруктураДанных.ВидСтатистики = ВидСтатистики;
	СтруктураДанных.Частота = Частота;
	
	ОтветСервера = 666;
	Если СразуОтправитьВДатаЦентр Тогда
//			ТелоСтроки = СтрШаблон("date=%1;uDate=%2;GMT=%3;user_id=%4;typeStat=%5", XMLСтрока(СтруктураДанных.ПериодРегистрации), XMLСтрока(СтруктураДанных.УниверсальнаяДата), ЧасовойПояс(), СтруктураДанных.User_id, Перечисления.ВидыСтатистики.Индекс(ВидСтатистики));		
//			ОтветСервера = ЗапросыHTTP_Сервер.ОтправитьСтатистикуВДатаЦентр(ТелоСтроки);
	КонецЕсли;
	СтруктураДанных.Отправлено = ОтветСервера = 200;

	РегистрыСведений.СтатистикаИспользованияСервисов.ЗаписатьСтатистику(СтруктураДанных);
КонецПроцедуры

Функция СформироватьСтруктуруСтатистики()
	Возврат РегистрыСведений.СтатистикаИспользованияСервисов.СформироватьСтруктуруСтатистики();
КонецФункции
#КонецОбласти
