
#Область ПрограммныйИнтерфейс
// Упаоковать файл в архив.
// 
// Параметры:
//  ИмяФайла - Строка - Путь к файлу
//  Пароль - Строка - Пароль
//  ПолучитьДвоичныеДанныеАрхива - Булево - Получить двоичные данные архива
// 
// Возвращаемое значение:
//  Строка - Путь к файлу прхива, либо адрес временного хранилища, либо пустая строка, если возникла ошибка при работе с архивом
Функция УпаковатьФайлВАрхив(ИмяФайла, Пароль = "DnkfnmeioWdv243mk", ПолучитьДвоичныеДанныеАрхива = Ложь) Экспорт
	Возврат СоздатьАрхивДанных(ИмяФайла, Пароль, ПолучитьДвоичныеДанныеАрхива);
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция СоздатьАрхивДанных(ИмяФайла, Пароль, ПолучитьДвоичныеДанныеАрхива)
	
	МетодСжатия = МетодСжатияZIP.Сжатие;
	УровеньСжатия = УровеньСжатияZIP.Максимальный;
	МетодШифрования = МетодШифрованияZIP.AES256;
	//@skip-check missing-temporary-file-deletion
	ИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip"); 
	
	Попытка
		Если ПолучитьДвоичныеДанныеАрхива Тогда
			Архив = Новый ЗаписьZipФайла;
			Архив.Добавить(ИмяФайла);
			ДвоичныеДанные = Архив.ПолучитьДвоичныеДанные(Пароль, , МетодСжатия, УровеньСжатия, МетодШифрования);
			АдресВремХран = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			Возврат АдресВремХран;
		Иначе
			Архив = Новый ЗаписьZipФайла(ИмяФайлаАрхива, Пароль, , МетодСжатия, УровеньСжатия, МетодШифрования);
			Архив.Добавить(ИмяФайла);
			Архив.Записать();
			Возврат ИмяФайлаАрхива;
		КонецЕсли;
	Исключение
		ТекстОшибки = "Не удалось создать архив!." + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(ТекстОшибки);
		Возврат "";
	КонецПопытки;
		
КонецФункции
#КонецОбласти
