
#Область ПрограммныйИнтерфейс
// Сформировать сеанс веб сервиса.
// 
// Параметры:
//  ПараметрыСервиса	- Структура: 
//  * ИмяСервиса		- Строка
//  * ИмяПортаСервиса	- Строка
//  * ИмяФайлаСервиса	- Строка
//  * ИмяПользователя	- Строка
//  * Пароль			- Строка
// 
// Возвращаемое значение:  
//  - Строка 
//  
Функция СформироватьСеансВебСервиса(ПараметрыСервиса) Экспорт
	АдресСоединения = ПараметрыСерверов.ПолучитьАдресСервера();
	ПространствоИмен = ПараметрыСервиса.ПространствоИмен;
	ИмяСервиса =  ПараметрыСервиса.ИмяСервиса;//"UserAuthorization";
	ИмяПортаСервиса = ПараметрыСервиса.ИмяПортаСервиса;//"UserAuthorizationSoap";
	АдресПодключения = СтрШаблон("http://%1/HB_Server/ws/%2", АдресСоединения, ПараметрыСервиса.ИмяФайлаСервиса);
	ВебСервис = WSСсылки.АвторизацияНаСервереДанных.СоздатьWSПрокси(ПространствоИмен, ИмяСервиса, ИмяПортаСервиса,,,, АдресПодключения);
	ВебСервис.Пользователь = ПараметрыСервиса.ИмяПользователя;//"Регистратор";
	ВебСервис.Пароль = ПараметрыСервиса.Пароль;
	Возврат ВебСервис;
КонецФункции

#КонецОбласти