											
Функция ПроверитьНаличиеДубляНаименования(ИмяЭлемента, ИмяОбъекта, СпрСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Объект.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Магазины КАК Объект
	               |ГДЕ
	               |	Объект.Наименование = &Наименование
	               |	И Объект.Ссылка <> &Ссылка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Магазины КАК Объект", "Справочник." + ИмяОбъекта + " КАК Объект");
	Если ЗначениеЗаполнено(СпрСсылка)  Тогда
		Запрос.УстановитьПараметр("Ссылка", СпрСсылка);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Объект.Ссылка <> &Ссылка", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Наименование", СокрЛП(ИмяЭлемента));	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();
КонецФункции

Функция ЗаданиеВыполнено(ПроверяемоеСобытие) Экспорт
	
	Результат = Новый Структура("НетДанных, Выполнено, ТекстСообщения", Истина, Ложь, "");
	
	Если ПроверяемоеСобытие = Перечисления.ПроверяемыеСобытияОбработчикаОжидания.Автобэкап Тогда
		УИД = Новый УникальныйИдентификатор(Константы.ФонУИД_Автобэкап.Получить());
	ИначеЕсли ПроверяемоеСобытие = Перечисления.ПроверяемыеСобытияОбработчикаОжидания.ОтправкаЛогов Тогда
		УИД = Новый УникальныйИдентификатор(Константы.ФонУИД_ОтправкаЛогов.Получить());
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УИД) Тогда
		Результат.Выполнено = Истина;
		Результат.ТекстСообщения = "Не удалось выполнить!";
		Возврат Результат;
	КонецЕсли;
	
	//Находим фоновое задание по идентификатору 
	ФонЗад = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(УИД);
	
	//Проверяем статус
	Если ФонЗад <> Неопределено Тогда
		Результат.НетДанных = Ложь;
		Если ФонЗад.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			Результат.Выполнено = Истина;
			Результат.ТекстСообщения = "Выполнен успешно";
		ИначеЕсли ФонЗад.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			Результат.Выполнено = Истина;
			Результат.ТекстСообщения = "Не удалось выполнить!";
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ФонЗад.ИнформацияОбОшибке);
			//ЛогированиеОшибок.ЗаписатьОшибкуВЛоги(ТекстОшибки);
		ИначеЕсли ФонЗад.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
			Результат.Выполнено = Истина;
			Результат.ТекстСообщения = "Не удалось выполнить!";
			
			
			Если ПроверяемоеСобытие = Перечисления.ПроверяемыеСобытияОбработчикаОжидания.Автобэкап Тогда
				ИмяФона = "Автобэкап";
			ИначеЕсли ПроверяемоеСобытие = Перечисления.ПроверяемыеСобытияОбработчикаОжидания.ОтправкаЛогов Тогда
				ИмяФона = "Отправка логов";
			ИначеЕсли ПроверяемоеСобытие = Перечисления.ПроверяемыеСобытияОбработчикаОжидания.ОтправкаСтатистики Тогда 
				ИмяФона = "Отправка статистики";
			КонецЕсли;
			
			//ЛогированиеОшибок.ЗаписатьОшибкуВЛоги("Отмена фонового задания: " + ИмяФона); 
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции