											
Функция ПроверитьНаличиеДубляНаименования(ИмяЭлемента, ИмяОбъекта, СпрСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Объект.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Магазины КАК Объект
	               |ГДЕ
	               |	Объект.Наименование = &Наименование
	               |	И Объект.Ссылка <> &Ссылка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Магазины КАК Объект", "Справочник." + ИмяОбъекта + " КАК Объект");
	Если ЗначениеЗаполнено(СпрСсылка)  Тогда
		Запрос.УстановитьПараметр("Ссылка", СпрСсылка);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Объект.Ссылка <> &Ссылка", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Наименование", СокрЛП(ИмяЭлемента));	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();
КонецФункции

Процедура ПоказатьСообщениеПользователю(ТекстСообщения) Экспорт
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
КонецПроцедуры