
Процедура ПоказатьСообщениеПользователю(ТекстСообщения) Экспорт
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
КонецПроцедуры 

Процедура ОбработатьИнформациюОбОшибкеДляПользователя(ТекстОшибки, ТекстДляПользователя = "") Экспорт
	ОбработатьИнформациюОбОшибкеДляПользователяАсинх(ТекстОшибки, ТекстДляПользователя);
КонецПроцедуры

АСИНХ Процедура ОбработатьИнформациюОбОшибкеДляПользователяАсинх(ТекстОшибки, ТекстДляПользователя) Экспорт //TODO: переделать на новый вариант АСИНХ
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("ОК", "ОК");
	Кнопки.Добавить("Отправить", "Отправить ошибку разработчику");
	
	Если Не ЗначениеЗаполнено(ТекстДляПользователя) Тогда
		Текст = "Произошла непредвиденная ошибка... Отправьте, пожалуйста, информацию об ошибке в техподдержку, чтобы разработчки как можно скорее исправил ошибку. Спасибо!"; 
	Иначе
		Текст = ТекстДляПользователя + " Отправьте, пожалуйста, информацию об ошибке в техподдержку, чтобы разработчки как можно скорее исправил ошибку. Спасибо!";
	КонецЕсли;
	
	Заголовок = "Что-то пошло не так...";
	
	Обещание = ЖДАТЬ ВопросАсинх(Текст, Кнопки,,, Заголовок);
	
	Если Обещание <> Неопределено Тогда
		Если Обещание = "Отправить" Тогда
			ДанныеОбОшибке = ЛогированиеОшибокСервер.ПодготовитьИнформацибОбОшибке(ТекстОшибки, Истина);
			Ответ = ЗапросыHTTP_Сервер.ОтправитьЛогиВДатаЦентр(ДанныеОбОшибке);
			//ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(, ДанныеОбОшибке); //Возможно, уже не нужно писть в логи, т.к., в основном, все логи должны быть записаны
			
			Если Ответ.ОтправленоУдачно Тогда
				ПоказатьОповещениеПользователя("Логи отправлены успешно");
			Иначе
				ПоказатьОповещениеПользователя("Произошла ошибка при отправке логов");
			КонецЕсли;
		Иначе 
			//TODO: ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(ТекстОшибки); //Возможно, уже не нужно писть в логи, т.к., в основном, все логи должны быть записаны
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
