
//TODO: дубль функций ОтправитьЛогиВДатаЦентр и ОтправитьСтатистикуВДатаЦентр Клиент/Сервер - перенести на сервер!?


Функция ОтправитьЛогиВДатаЦентр(Знач Данные = Неопределено, ОбработатьЛогиПослеВыгрузки = Ложь) Экспорт
	СборСтатистикиСервер.ЗаписатьФактИспользованияСервиса(ПредопределенноеЗначение("Перечисление.ВидыСтатистики.ОтправкаЛогов"));
	СтруктураВозврата = Новый Структура("ОтправленоУдачно, Ошибка", Ложь, "");
	
	Если Не ЗначениеЗаполнено(Данные) Тогда
		ДанныеДляОтправки = ВыгрузкаДанныхСервер.ПолучитьДанныеЛоговДляВыгрузки();
		ОбработатьЛогиПослеВыгрузки = Истина;
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура") Тогда
		ДанныеДляОтправки = ВыгрузкаДанныхСервер.ПолучитьXMLСтроку(ВыгрузкаДанныхСервер.ПреобразоватьДанныеСтрокаВХранилище(Данные));
		ОбработатьЛогиПослеВыгрузки = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеДляОтправки) Тогда
		ДиалогиСПользователямиСервер.ПоказатьСообщениеПользователю("Нет данных для выгрузки");
		СтруктураВозврата.Ошибка = "Нет данных для выгрузки";
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	АдресСкрипта = "HomeBudget_backUp/hs/download_log_info/";
	
	ПараметрыПодключения = ИнициализироватьПараметрыПодключения("192.168.1.140");
	ПараметрыЗапроса = ИнициализироватьПараметрыЗапроса(АдресСкрипта);
	
	ПараметрыЗапроса.Метод = "POST";
	
	ПараметрыПодключения.ИмяПользователя = "service";
	ПараметрыПодключения.Пароль = "hr65kl81";
	
	//TODO: ssl = Новый ЗащищенноеСоединениеOpenSSL;
	
	ПараметрыЗапроса.ЗапросHTTP.Заголовки.Вставить("Content-Type", "multipart/form-data");
	
	РазмерФайлаОтправки = ВыгрузкаДанныхСервер.ПолучитьXMLСтроку(СтрДлина(ДанныеДляОтправки));
	ПараметрыЗапроса.ЗапросHTTP.Заголовки.Вставить("Content-Length", РазмерФайлаОтправки);
	
	ОтветHTTP = ВыполнитьHTTTP_Запрос(ПараметрыПодключения, ПараметрыЗапроса, Истина, Истина, ДанныеДляОтправки, Истина);    //TODO: Сделат в попытка!!!
	
	Если ОтветHTTP = Неопределено Тогда
		СтруктураВозврата.ОтправленоУдачно = Ложь;
		СтруктураВозврата.Ошибка = "Не удалось отправить логи.";
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Текст = ОтветHTTP.ПолучитьТелоКакСтроку("utf-8");
	
	Если ОтветHTTP.КодСостояния = 200 Тогда			
		
		СтруктураВозврата.ОтправленоУдачно = Истина;
		
	Иначе
		ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(Текст);
		
		СтруктураВозврата.ОтправленоУдачно = Ложь;
		СтруктураВозврата.Ошибка = Текст;
	КонецЕсли;
	
	Если ОтветHTTP.КодСостояния = 200 И ОбработатьЛогиПослеВыгрузки Тогда
		ЛогированиеОшибокСервер.ОбработатьЛогиПослеВыгрузки(ДанныеДляОтправки);		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ОтправитьСтатистикуВДатаЦентр(Данные, ВыводитьСообщение = Ложь)Экспорт
	
	ИмяПользователя = "service"; //TODO: переделать по стандартам
	Пароль = "hr65kl81";        //TODO: переделать по стандартам
	
	//TODO: ssl = Новый ЗащищенноеСоединениеOpenSSL;	
	АдресСервера = "192.168.1.140";  //TODO: переделать по стандартам
	АдресСкрипта = "HomeBudget_backUp/hs/download_statistics/"; 
	
	ПараметрыПодключения = ИнициализироватьПараметрыПодключения(АдресСервера); //TODO: переделать по стандартам
	ПараметрыЗапроса = ИнициализироватьПараметрыЗапроса(АдресСкрипта);
	
	ПараметрыЗапроса.Метод = "POST";
	
	ПараметрыПодключения.ИмяПользователя = ИмяПользователя;
	ПараметрыПодключения.Пароль = Пароль;
	
	ПараметрыЗапроса.ЗапросHTTP.Заголовки.Вставить("Content-Type", "text/html");
	
	ОтветHTTP = ВыполнитьHTTTP_Запрос(ПараметрыПодключения, ПараметрыЗапроса, Истина, Истина, Данные, Истина);
	
	Текст = ОтветHTTP.ПолучитьТелоКакСтроку("utf-8");
	
	Если ОтветHTTP.КодСостояния = 200 Тогда			
		Если ВыводитьСообщение Тогда
			ДиалогиСПользователемКлиент.ПоказатьСообщениеПользователю(Текст);
		КонецЕсли;
	Иначе
		ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(Текст)
	КонецЕсли;
	
	Возврат ОтветHTTP.КодСостояния;
КонецФункции

// Функция - Выполнить HTTTP запрос
// 
// Параметры:
//  ПараметрыПодключения - Структура - Параметры подключения:
// * Сервер - Строка 
// * Порт - Строка
// * ИмяПользователя - Строка
// * Пароль - Строка
// * Прокси - Строка
// * Таймаут - Число
// * ЗащищенноеСоединение - ЗащищенноеСоединениеOpenSSL 
//  ПараметрыЗапроса - Структура - 
//  ПоказатьСообщениеОшибки - Булево - Показать сообщение ошибки
//  УстановитьТело - Булево - ПоказатьСообщениеОшибки	 - Булево	 -  определяет, показывать сообщение пользователю при наличии ошибки исполнения функции
//  ТелоЗапроса - ДвоичныеДанные - 
//  ТелоКакСтрока - Булево - Возвращаемое значение - HTTPОтвет, Неопределено
// 
// Возвращаемое значение:
//  Неопределено, HTTPОтвет - Выполнить HTTTP запрос
Функция ВыполнитьHTTTP_Запрос(ПараметрыПодключения, ПараметрыЗапроса, ПоказатьСообщениеОшибки = Истина, УстановитьТело = Ложь, ТелоЗапроса = Неопределено, ТелоКакСтрока = Ложь) Экспорт
	
	ХТТП = Новый HTTPСоединение(ПараметрыПодключения.Сервер,, ПараметрыПодключения.ИмяПользователя, ПараметрыПодключения.Пароль);
	Попытка
		ЗапросHTTP = ПараметрыЗапроса.ЗапросHTTP;
		Если УстановитьТело И ТелоЗапроса <> Неопределено Тогда
			Если ТелоКакСтрока Тогда
				ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса);
			Иначе
				ЗапросHTTP.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);
			КонецЕсли;
		КонецЕсли;
		
		Возврат ХТТП.ВызватьHTTPМетод(ПараметрыЗапроса.Метод, ЗапросHTTP);
		
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(Текст);
		
		Если ПоказатьСообщениеОшибки Тогда 
			ДиалогиСПользователемКлиент.ОбработатьИнформациюОбОшибкеДляПользователя(Текст);
		КонецЕсли;
		
		Возврат Неопределено;
		
	КонецПопытки;

КонецФункции

Функция ИнициализироватьПараметрыПодключения(Сервер, ИспользоватьSSL = Ложь)
	Параметры = Новый Структура;
	Параметры.Вставить("Сервер");
	Параметры.Вставить("Порт");
	Параметры.Вставить("ИмяПользователя");
	Параметры.Вставить("Пароль");
	Параметры.Вставить("Прокси");
	Параметры.Вставить("Таймаут");
	Параметры.Вставить("ЗащищенноеСоединение");
	
	Параметры.Сервер = Сервер;
	Параметры.Порт = ?(ИспользоватьSSL, 443, 80);
	Параметры.ИмяПользователя = "";
	Параметры.Пароль = "";
	Параметры.Прокси = Новый ИнтернетПрокси;
	Параметры.Таймаут = 30;
	Параметры.ЗащищенноеСоединение = ?(ИспользоватьSSL, Новый ЗащищенноеСоединениеOpenSSL, Неопределено);
	
	Возврат Параметры;
КонецФункции

Функция ИнициализироватьПараметрыЗапроса(АдресСкрипта)
	Параметры = Новый Структура("Метод, ЗапросHTTP, АдресСкрипта");
	Параметры.Метод = "";
	Параметры.ЗапросHTTP = Новый HTTPЗапрос(АдресСкрипта, Новый Соответствие);
	Параметры.АдресСкрипта = АдресСкрипта;
	
	Возврат Параметры;
КонецФункции
