
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбщиеПроцедурыИФункцииКлиент.ОбновиьГлавныйЭкран();
	ОбщиеПроцедурыИФункцииКлиент.УстановитьСчет(Объект, "СчетПоступления");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСчетПоУмолчанию();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетПоУмолчанию()
	СчетПоУмолчанию = Справочники.Счета.ПолучитьСчетДляИсточникаПоступления();
	Если ЗначениеЗаполнено(СчетПоУмолчанию) Тогда
		Объект.СчетПоступления = СчетПоУмолчанию
	КонецЕсли;
КонецПроцедуры
