
Процедура ЗагрузитьДанные(ЗагрузкаССервера, ИмяПользователя = Неопределено, Пароль = Неопределено, ТолькоСправочники = Ложь) Экспорт
	
	Если ЗагрузкаССервера Тогда
		СборСтатистикиСервер.ЗаписатьФактИспользованияСервиса(ПредопределенноеЗначение("Перечисление.ВидыСтатистики.ВосстановлениеДанныхОблако"), Истина);
		Путь = ПолучитьИмяВременногоФайла("txt");
		ЗапросыHTTP_Клиент.ПолучитьДанныеССервера(Путь, ИмяПользователя, Пароль);
	Иначе
		СборСтатистикиСервер.ЗаписатьФактИспользованияСервиса(ПредопределенноеЗначение("Перечисление.ВидыСтатистики.ВосстановлениеДанныхЛокально"), Истина);
		Путь = КаталогДокументов() + "\backUp_1CDB.txt";
	КонецЕсли;
	ЗагрузкаДанныхСервер.ЗагрузитьДанные(Путь, ТолькоСправочники);	
КонецПроцедуры


