
АСИНХ Процедура ЗагрузитьДанные(ЗагрузкаССервера) Экспорт
	Обещание = Ждать КаталогВременныхФайловАсинх();
	Путь = Обещание;
	Если ЗагрузкаССервера Тогда
		СборСтатистикиСервер.ЗаписатьФактИспользованияСервиса(ПредопределенноеЗначение("Перечисление.ВидыСтатистики.ВосстановлениеДанныхОблако"), Истина);
		ЗапросыHTTP_Сервер.ПолучитьДанныеССервера(Путь);
	Иначе
		//TODO: Здесь необходимо делать полный бэкап?!!!
		СборСтатистикиСервер.ЗаписатьФактИспользованияСервиса(ПредопределенноеЗначение("Перечисление.ВидыСтатистики.ВосстановлениеДанныхЛокально"), Истина);
		Путь = КаталогДокументов() + "\backUp_1CDB.txt";
		ЗагрузкаДанныхСервер.ЗагрузитьДанные(Путь);
	КонецЕсли;	
КонецПроцедуры


