
Процедура ЗаписатьОшибкуВЛоги(ТекстОшибки, СтруктураДанных = Неопределено, ОтправитьНаСервер = Истина, Важность = Неопределено) Экспорт
	РегистрыСведений.ЛогиОшибок.ЗаписатьОшибкуВЛоги(ТекстОшибки, СтруктураДанных = Неопределено, ОтправитьНаСервер = Истина, Важность = Неопределено);
КонецПроцедуры

Функция ПодготовитьИнформацибОбОшибке(ТекстОшибки, Отправлено = Ложь, Важность = Неопределено) Экспорт
	Возврат РегистрыСведений.ЛогиОшибок.ПодготовитьИнформацибОбОшибке(ТекстОшибки, Отправлено = Ложь, Важность = Неопределено);
КонецФункции

Функция ОбработатьЛогиПослеВыгрузки(Данные) Экспорт
	РегистрыСведений.ЛогиОшибок.ОбработатьЛогиПослеВыгрузки(Данные);
КонецФункции