
#Область ПрограммныйИнтерфейс

// Записать ошибку в логи.
// 
// Параметры:
//  ТекстОшибки - Строка
//  СтруктураДанных - Структура
//  ОтправитьНаСервер - Булево - Отправить на сервер
//  Важность - ПеречислениеСсылка.КритерииОшибок
Процедура ЗаписатьОшибкуВЛоги(ТекстОшибки, СтруктураДанных = Неопределено, ОтправитьНаСервер = Истина, Важность = Неопределено) Экспорт
	РегистрыСведений.ЛогиОшибок.ЗаписатьОшибкуВЛоги(ТекстОшибки, СтруктураДанных, ОтправитьНаСервер, Важность);
КонецПроцедуры

#КонецОбласти


Функция ПодготовитьИнформацибОбОшибке(ТекстОшибки, Отправлено = Ложь, Важность = Неопределено) Экспорт
	Возврат РегистрыСведений.ЛогиОшибок.ПодготовитьИнформацибОбОшибке(ТекстОшибки, Отправлено, Важность);
КонецФункции

Функция ОбработатьЛогиПослеВыгрузки(Данные) Экспорт
	РегистрыСведений.ЛогиОшибок.ОбработатьЛогиПослеВыгрузки(Данные);
КонецФункции
